<?php
include('config.php'); // Включване на конфигурационния файл, съдържащ настройките за базата данни (напр. връзка с MySQL)

if (isset($_GET['u'])) { // Проверка дали параметърът 'u' (съкратен URL) е предоставен в URL адреса
    $shortened_url = $_GET['u']; // Присвояване на съкратената връзка от URL параметъра към променлива

    // Подготвяме SQL заявка за търсене на оригиналния URL в базата данни, който съответства на съкратената връзка
    $stmt = $pdo->prepare("SELECT original_url FROM urls WHERE shortened_url = :shortened_url");
    
    // Изпълняваме заявката, като подаваме стойността на съкратената връзка като параметър
    $stmt->execute(['shortened_url' => $shortened_url]);

    // Вземаме резултата от заявката като асоциативен масив
    $url = $stmt->fetch(PDO::FETCH_ASSOC);

    // Проверяваме дали е намерен резултат (оригинален URL)
    if ($url) {
        // Ако има намерен оригинален URL, пренасочваме потребителя към него
        header("Location: " . $url['original_url']);
        exit; // Прекратяваме изпълнението на скрипта, за да не се изпълни никакъв друг код след пренасочването
    } else {
        // Ако не е намерен оригинален URL за дадената съкратена връзка
        echo "Invalid URL!"; // Показваме съобщение за невалидна връзка
    }
}
?>
